 # Połączenie z bazą danych przy pomocy sqlAlchemy

In [115]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

Zapytanie do bazy i wypisanie wyników

In [116]:
result_set = db.execute("SELECT * FROM city")  
for r in result_set:  
    print(r)

(1, 'A Corua (La Corua)', 87, datetime.datetime(2006, 2, 15, 9, 45, 25))
(2, 'Abha', 82, datetime.datetime(2006, 2, 15, 9, 45, 25))
(3, 'Abu Dhabi', 101, datetime.datetime(2006, 2, 15, 9, 45, 25))
(4, 'Acua', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(5, 'Adana', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(6, 'Addis Abeba', 31, datetime.datetime(2006, 2, 15, 9, 45, 25))
(7, 'Aden', 107, datetime.datetime(2006, 2, 15, 9, 45, 25))
(8, 'Adoni', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(9, 'Ahmadnagar', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(10, 'Akishima', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(11, 'Akron', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(12, 'al-Ayn', 101, datetime.datetime(2006, 2, 15, 9, 45, 25))
(13, 'al-Hawiya', 82, datetime.datetime(2006, 2, 15, 9, 45, 25))
(14, 'al-Manama', 11, datetime.datetime(2006, 2, 15, 9, 45, 25))
(15, 'al-Qadarif', 89, datetime.datetime(2006, 2, 15, 9, 45, 25))
(16, 'al-Qatif', 82, datetime.datetime(2006, 2, 15, 9, 45, 25))
(17, 'Alessandria', 49, datetime.datetime(2006, 2, 15, 9, 45, 25))
(18, 'Allappuzha (Alleppey)', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(19, 'Allende', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(20, 'Almirante Brown', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(21, 'Alvorada', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(22, 'Ambattur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(23, 'Amersfoort', 67, datetime.datetime(2006, 2, 15, 9, 45, 25))
(24, 'Amroha', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(25, 'Angra dos Reis', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(26, 'Anpolis', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(27, 'Antofagasta', 22, datetime.datetime(2006, 2, 15, 9, 45, 25))
(28, 'Aparecida de Goinia', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(29, 'Apeldoorn', 67, datetime.datetime(2006, 2, 15, 9, 45, 25))
(30, 'Araatuba', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(31, 'Arak', 46, datetime.datetime(2006, 2, 15, 9, 45, 25))
(32, 'Arecibo', 77, datetime.datetime(2006, 2, 15, 9, 45, 25))
(33, 'Arlington', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(34, 'Ashdod', 48, datetime.datetime(2006, 2, 15, 9, 45, 25))
(35, 'Ashgabat', 98, datetime.datetime(2006, 2, 15, 9, 45, 25))
(36, 'Ashqelon', 48, datetime.datetime(2006, 2, 15, 9, 45, 25))
(37, 'Asuncin', 73, datetime.datetime(2006, 2, 15, 9, 45, 25))
(38, 'Athenai', 39, datetime.datetime(2006, 2, 15, 9, 45, 25))
(39, 'Atinsk', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(40, 'Atlixco', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(41, 'Augusta-Richmond County', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(42, 'Aurora', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(43, 'Avellaneda', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(44, 'Bag', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(45, 'Baha Blanca', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(46, 'Baicheng', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(47, 'Baiyin', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(48, 'Baku', 10, datetime.datetime(2006, 2, 15, 9, 45, 25))
(49, 'Balaiha', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(50, 'Balikesir', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(51, 'Balurghat', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(52, 'Bamenda', 19, datetime.datetime(2006, 2, 15, 9, 45, 25))
(53, 'Bandar Seri Begawan', 16, datetime.datetime(2006, 2, 15, 9, 45, 25))
(54, 'Banjul', 37, datetime.datetime(2006, 2, 15, 9, 45, 25))
(55, 'Barcelona', 104, datetime.datetime(2006, 2, 15, 9, 45, 25))
(56, 'Basel', 91, datetime.datetime(2006, 2, 15, 9, 45, 25))
(57, 'Bat Yam', 48, datetime.datetime(2006, 2, 15, 9, 45, 25))
(58, 'Batman', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(59, 'Batna', 2, datetime.datetime(2006, 2, 15, 9, 45, 25))
(60, 'Battambang', 18, datetime.datetime(2006, 2, 15, 9, 45, 25))
(61, 'Baybay', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(62, 'Bayugan', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(63, 'Bchar', 2, datetime.datetime(2006, 2, 15, 9, 45, 25))
(64, 'Beira', 63, datetime.datetime(2006, 2, 15, 9, 45, 25))
(65, 'Bellevue', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(66, 'Belm', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(67, 'Benguela', 4, datetime.datetime(2006, 2, 15, 9, 45, 25))
(68, 'Beni-Mellal', 62, datetime.datetime(2006, 2, 15, 9, 45, 25))
(69, 'Benin City', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(70, 'Bergamo', 49, datetime.datetime(2006, 2, 15, 9, 45, 25))
(71, 'Berhampore (Baharampur)', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(72, 'Bern', 91, datetime.datetime(2006, 2, 15, 9, 45, 25))
(73, 'Bhavnagar', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(74, 'Bhilwara', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(75, 'Bhimavaram', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(76, 'Bhopal', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(77, 'Bhusawal', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(78, 'Bijapur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(79, 'Bilbays', 29, datetime.datetime(2006, 2, 15, 9, 45, 25))
(80, 'Binzhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(81, 'Birgunj', 66, datetime.datetime(2006, 2, 15, 9, 45, 25))
(82, 'Bislig', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(83, 'Blumenau', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(84, 'Boa Vista', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(85, 'Boksburg', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(86, 'Botosani', 78, datetime.datetime(2006, 2, 15, 9, 45, 25))
(87, 'Botshabelo', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(88, 'Bradford', 102, datetime.datetime(2006, 2, 15, 9, 45, 25))
(89, 'Braslia', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(90, 'Bratislava', 84, datetime.datetime(2006, 2, 15, 9, 45, 25))
(91, 'Brescia', 49, datetime.datetime(2006, 2, 15, 9, 45, 25))
(92, 'Brest', 34, datetime.datetime(2006, 2, 15, 9, 45, 25))
(93, 'Brindisi', 49, datetime.datetime(2006, 2, 15, 9, 45, 25))
(94, 'Brockton', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(95, 'Bucuresti', 78, datetime.datetime(2006, 2, 15, 9, 45, 25))
(96, 'Buenaventura', 24, datetime.datetime(2006, 2, 15, 9, 45, 25))
(97, 'Bydgoszcz', 76, datetime.datetime(2006, 2, 15, 9, 45, 25))
(98, 'Cabuyao', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(99, 'Callao', 74, datetime.datetime(2006, 2, 15, 9, 45, 25))
(100, 'Cam Ranh', 105, datetime.datetime(2006, 2, 15, 9, 45, 25))
(101, 'Cape Coral', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(102, 'Caracas', 104, datetime.datetime(2006, 2, 15, 9, 45, 25))
(103, 'Carmen', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(104, 'Cavite', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(105, 'Cayenne', 35, datetime.datetime(2006, 2, 15, 9, 45, 25))
(106, 'Celaya', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(107, 'Chandrapur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(108, 'Changhwa', 92, datetime.datetime(2006, 2, 15, 9, 45, 25))
(109, 'Changzhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(110, 'Chapra', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(111, 'Charlotte Amalie', 106, datetime.datetime(2006, 2, 15, 9, 45, 25))
(112, 'Chatsworth', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(113, 'Cheju', 86, datetime.datetime(2006, 2, 15, 9, 45, 25))
(114, 'Chiayi', 92, datetime.datetime(2006, 2, 15, 9, 45, 25))
(115, 'Chisinau', 61, datetime.datetime(2006, 2, 15, 9, 45, 25))
(116, 'Chungho', 92, datetime.datetime(2006, 2, 15, 9, 45, 25))
(117, 'Cianjur', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(118, 'Ciomas', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(119, 'Ciparay', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(120, 'Citrus Heights', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(121, 'Citt del Vaticano', 41, datetime.datetime(2006, 2, 15, 9, 45, 25))
(122, 'Ciudad del Este', 73, datetime.datetime(2006, 2, 15, 9, 45, 25))
(123, 'Clarksville', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(124, 'Coacalco de Berriozbal', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(125, 'Coatzacoalcos', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(126, 'Compton', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(127, 'Coquimbo', 22, datetime.datetime(2006, 2, 15, 9, 45, 25))
(128, 'Crdoba', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(129, 'Cuauhtmoc', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(130, 'Cuautla', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(131, 'Cuernavaca', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(132, 'Cuman', 104, datetime.datetime(2006, 2, 15, 9, 45, 25))
(133, 'Czestochowa', 76, datetime.datetime(2006, 2, 15, 9, 45, 25))
(134, 'Dadu', 72, datetime.datetime(2006, 2, 15, 9, 45, 25))
(135, 'Dallas', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(136, 'Datong', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(137, 'Daugavpils', 54, datetime.datetime(2006, 2, 15, 9, 45, 25))
(138, 'Davao', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(139, 'Daxian', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(140, 'Dayton', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(141, 'Deba Habe', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(142, 'Denizli', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(143, 'Dhaka', 12, datetime.datetime(2006, 2, 15, 9, 45, 25))
(144, 'Dhule (Dhulia)', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(145, 'Dongying', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(146, 'Donostia-San Sebastin', 87, datetime.datetime(2006, 2, 15, 9, 45, 25))
(147, 'Dos Quebradas', 24, datetime.datetime(2006, 2, 15, 9, 45, 25))
(148, 'Duisburg', 38, datetime.datetime(2006, 2, 15, 9, 45, 25))
(149, 'Dundee', 102, datetime.datetime(2006, 2, 15, 9, 45, 25))
(150, 'Dzerzinsk', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(151, 'Ede', 67, datetime.datetime(2006, 2, 15, 9, 45, 25))
(152, 'Effon-Alaiye', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(153, 'El Alto', 14, datetime.datetime(2006, 2, 15, 9, 45, 25))
(154, 'El Fuerte', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(155, 'El Monte', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(156, 'Elista', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(157, 'Emeishan', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(158, 'Emmen', 67, datetime.datetime(2006, 2, 15, 9, 45, 25))
(159, 'Enshi', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(160, 'Erlangen', 38, datetime.datetime(2006, 2, 15, 9, 45, 25))
(161, 'Escobar', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(162, 'Esfahan', 46, datetime.datetime(2006, 2, 15, 9, 45, 25))
(163, 'Eskisehir', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(164, 'Etawah', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(165, 'Ezeiza', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(166, 'Ezhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(167, 'Faaa', 36, datetime.datetime(2006, 2, 15, 9, 45, 25))
(168, 'Fengshan', 92, datetime.datetime(2006, 2, 15, 9, 45, 25))
(169, 'Firozabad', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(170, 'Florencia', 24, datetime.datetime(2006, 2, 15, 9, 45, 25))
(171, 'Fontana', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(172, 'Fukuyama', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(173, 'Funafuti', 99, datetime.datetime(2006, 2, 15, 9, 45, 25))
(174, 'Fuyu', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(175, 'Fuzhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(176, 'Gandhinagar', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(177, 'Garden Grove', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(178, 'Garland', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(179, 'Gatineau', 20, datetime.datetime(2006, 2, 15, 9, 45, 25))
(180, 'Gaziantep', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(181, 'Gijn', 87, datetime.datetime(2006, 2, 15, 9, 45, 25))
(182, 'Gingoog', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(183, 'Goinia', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(184, 'Gorontalo', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(185, 'Grand Prairie', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(186, 'Graz', 9, datetime.datetime(2006, 2, 15, 9, 45, 25))
(187, 'Greensboro', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(188, 'Guadalajara', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(189, 'Guaruj', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(190, 'guas Lindas de Gois', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(191, 'Gulbarga', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(192, 'Hagonoy', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(193, 'Haining', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(194, 'Haiphong', 105, datetime.datetime(2006, 2, 15, 9, 45, 25))
(195, 'Haldia', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(196, 'Halifax', 20, datetime.datetime(2006, 2, 15, 9, 45, 25))
(197, 'Halisahar', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(198, 'Halle/Saale', 38, datetime.datetime(2006, 2, 15, 9, 45, 25))
(199, 'Hami', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(200, 'Hamilton', 68, datetime.datetime(2006, 2, 15, 9, 45, 25))
(201, 'Hanoi', 105, datetime.datetime(2006, 2, 15, 9, 45, 25))
(202, 'Hidalgo', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(203, 'Higashiosaka', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(204, 'Hino', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(205, 'Hiroshima', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(206, 'Hodeida', 107, datetime.datetime(2006, 2, 15, 9, 45, 25))
(207, 'Hohhot', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(208, 'Hoshiarpur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(209, 'Hsichuh', 92, datetime.datetime(2006, 2, 15, 9, 45, 25))
(210, 'Huaian', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(211, 'Hubli-Dharwad', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(212, 'Huejutla de Reyes', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(213, 'Huixquilucan', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(214, 'Hunuco', 74, datetime.datetime(2006, 2, 15, 9, 45, 25))
(215, 'Ibirit', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(216, 'Idfu', 29, datetime.datetime(2006, 2, 15, 9, 45, 25))
(217, 'Ife', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(218, 'Ikerre', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(219, 'Iligan', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(220, 'Ilorin', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(221, 'Imus', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(222, 'Inegl', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(223, 'Ipoh', 59, datetime.datetime(2006, 2, 15, 9, 45, 25))
(224, 'Isesaki', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(225, 'Ivanovo', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(226, 'Iwaki', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(227, 'Iwakuni', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(228, 'Iwatsuki', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(229, 'Izumisano', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(230, 'Jaffna', 88, datetime.datetime(2006, 2, 15, 9, 45, 25))
(231, 'Jaipur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(232, 'Jakarta', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(233, 'Jalib al-Shuyukh', 53, datetime.datetime(2006, 2, 15, 9, 45, 25))
(234, 'Jamalpur', 12, datetime.datetime(2006, 2, 15, 9, 45, 25))
(235, 'Jaroslavl', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(236, 'Jastrzebie-Zdrj', 76, datetime.datetime(2006, 2, 15, 9, 45, 25))
(237, 'Jedda', 82, datetime.datetime(2006, 2, 15, 9, 45, 25))
(238, 'Jelets', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(239, 'Jhansi', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(240, 'Jinchang', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(241, 'Jining', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(242, 'Jinzhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(243, 'Jodhpur', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(244, 'Johannesburg', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(245, 'Joliet', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(246, 'Jos Azueta', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(247, 'Juazeiro do Norte', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(248, 'Juiz de Fora', 15, datetime.datetime(2006, 2, 15, 9, 45, 25))
(249, 'Junan', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(250, 'Jurez', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(251, 'Kabul', 1, datetime.datetime(2006, 2, 15, 9, 45, 25))
(252, 'Kaduna', 69, datetime.datetime(2006, 2, 15, 9, 45, 25))
(253, 'Kakamigahara', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(254, 'Kaliningrad', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(255, 'Kalisz', 76, datetime.datetime(2006, 2, 15, 9, 45, 25))
(256, 'Kamakura', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(257, 'Kamarhati', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(258, 'Kamjanets-Podilskyi', 100, datetime.datetime(2006, 2, 15, 9, 45, 25))
(259, 'Kamyin', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(260, 'Kanazawa', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(261, 'Kanchrapara', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(262, 'Kansas City', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(263, 'Karnal', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(264, 'Katihar', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(265, 'Kermanshah', 46, datetime.datetime(2006, 2, 15, 9, 45, 25))
(266, 'Kilis', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(267, 'Kimberley', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(268, 'Kimchon', 86, datetime.datetime(2006, 2, 15, 9, 45, 25))
(269, 'Kingstown', 81, datetime.datetime(2006, 2, 15, 9, 45, 25))
(270, 'Kirovo-Tepetsk', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(271, 'Kisumu', 52, datetime.datetime(2006, 2, 15, 9, 45, 25))
(272, 'Kitwe', 109, datetime.datetime(2006, 2, 15, 9, 45, 25))
(273, 'Klerksdorp', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))
(274, 'Kolpino', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(275, 'Konotop', 100, datetime.datetime(2006, 2, 15, 9, 45, 25))
(276, 'Koriyama', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(277, 'Korla', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(278, 'Korolev', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(279, 'Kowloon and New Kowloon', 42, datetime.datetime(2006, 2, 15, 9, 45, 25))
(280, 'Kragujevac', 108, datetime.datetime(2006, 2, 15, 9, 45, 25))
(281, 'Ktahya', 97, datetime.datetime(2006, 2, 15, 9, 45, 25))
(282, 'Kuching', 59, datetime.datetime(2006, 2, 15, 9, 45, 25))
(283, 'Kumbakonam', 44, datetime.datetime(2006, 2, 15, 9, 45, 25))
(284, 'Kurashiki', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(285, 'Kurgan', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(286, 'Kursk', 80, datetime.datetime(2006, 2, 15, 9, 45, 25))
(287, 'Kuwana', 50, datetime.datetime(2006, 2, 15, 9, 45, 25))
(288, 'La Paz', 60, datetime.datetime(2006, 2, 15, 9, 45, 25))
(289, 'La Plata', 6, datetime.datetime(2006, 2, 15, 9, 45, 25))
(290, 'La Romana', 27, datetime.datetime(2006, 2, 15, 9, 45, 25))
(291, 'Laiwu', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(292, 'Lancaster', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(293, 'Laohekou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(294, 'Lapu-Lapu', 75, datetime.datetime(2006, 2, 15, 9, 45, 25))
(295, 'Laredo', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(296, 'Lausanne', 91, datetime.datetime(2006, 2, 15, 9, 45, 25))
(297, 'Le Mans', 34, datetime.datetime(2006, 2, 15, 9, 45, 25))
(298, 'Lengshuijiang', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(299, 'Leshan', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(300, 'Lethbridge', 20, datetime.datetime(2006, 2, 15, 9, 45, 25))
(301, 'Lhokseumawe', 45, datetime.datetime(2006, 2, 15, 9, 45, 25))
(302, 'Liaocheng', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))
(303, 'Liepaja', 54, datetime.datetime(2006, 2, 15, 9, 45, 25))
(304, 'Lilongwe', 58, datetime.datetime(2006, 2, 15, 9, 45, 25))
(305, 'Lima', 74, datetime.datetime(2006, 2, 15, 9, 45, 25))
(306, 'Lincoln', 103, datetime.datetime(2006, 2, 15, 9, 45, 25))
(307, 'Linz', 9, datetime.datetime(2006, 2, 15, 9, 45, 25))

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [117]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [118]:
df = pd.read_sql('select * from city',con=connection)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

## Połączenie za pomocą sqlAlchemy i pandas

In [119]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

**Ćwiczenie**

In [120]:
#1
df = pd.read_sql('select count(distinct name) from category', con=connection_sqlalchemy)
df

   count
0     16

In [121]:
#2
df = pd.read_sql('select distinct name from category order by name', con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [122]:
#3
#najstarszy
df = pd.read_sql('select title from film order by release_year limit 1', con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [123]:
#najmłodszy
df = pd.read_sql('select title from film order by release_year desc limit 1', con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [124]:
#4
df = pd.read_sql("select count(rental_id) from rental where rental_date between '20050701 000000' and '20050801 235959'", con=connection_sqlalchemy)
df

   count
0   7380

In [125]:
#5
df = pd.read_sql("select count(rental_id) from rental where rental_date between '20100101 000000' and '20110201 235959'", con=connection_sqlalchemy)
df

   count
0      0

In [126]:
#6
df = pd.read_sql("select max(amount) from payment", con=connection_sqlalchemy)
df

     max
0  11.99

In [127]:
#7
df = pd.read_sql("select customer.customer_id, customer.first_name, customer.last_name, country.country from customer\
                  inner join address on customer.address_id = address.address_id\
                  inner join city on address.city_id = city.city_id \
                  inner join country on city.country_id = country.country_id\
                  where country in ('Nigeria', 'Poland', 'Bangladesh')", con=connection_sqlalchemy)
df

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

In [128]:
#8
df = pd.read_sql("select staff.first_name, staff.last_name, address.address, city.city, country.country from staff\
                  inner join address on staff.address_id = address.address_id \
                  inner join city on address.city_id = city.city_id\
                  inner join country on city.country_id = country.country_id", con=connection_sqlalchemy)
df

  first_name last_name               address        city    country
0       Mike   Hillyer     23 Workhaven Lane  Lethbridge     Canada
1        Jon  Stephens  1411 Lillydale Drive   Woodridge  Australia

In [129]:
#9
df = pd.read_sql("select count(staff.staff_id) from staff\
                  inner join address on staff.address_id = address.address_id \
                  inner join city on address.city_id = city.city_id\
                  inner join country on city.country_id = country.country_id\
                  where country.country in ('Argentina', 'Spain')", con=connection_sqlalchemy)
df

   count
0      0

In [130]:
#10
df = pd.read_sql("select distinct category.name from category\
                  inner join film_category on category.category_id = film_category.category_id\
                  inner join film on film_category.film_id = film.film_id\
                  inner join inventory on film.film_id = inventory.film_id\
                  inner join rental on inventory.inventory_id=rental.inventory_id\
                  inner join customer on rental.customer_id = customer.customer_id", con=connection_sqlalchemy)
df

           name
0        Horror
1        Comedy
2         Drama
3        Sci-Fi
4       Foreign
5      Classics
6         Games
7        Travel
8           New
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

In [131]:
#11
df = pd.read_sql("select distinct category.name from category\
                  inner join film_category on category.category_id = film_category.category_id\
                  inner join film on film_category.film_id = film.film_id\
                  inner join inventory on film.film_id = inventory.film_id\
                  inner join rental on inventory.inventory_id=rental.inventory_id\
                  inner join staff on rental.staff_id = staff.staff_id\
                  inner join store on staff.store_id = store.store_id\
                  inner join address on store.address_id = address.address_id\
                  inner join city on address.city_id = city.city_id\
                  inner join country on city.country_id = country.country_id\
                  where country in ('United States', 'Canada', 'Mexico')", con=connection_sqlalchemy)
df

           name
0        Comedy
1        Horror
2        Sci-Fi
3         Drama
4       Foreign
5      Classics
6         Games
7        Travel
8           New
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

In [133]:
#12
df = pd.read_sql("select film.title, actor.first_name, actor.last_name from film\
                  inner join film_actor on film.film_id = film_actor.film_id\
                  inner join actor on film_actor.actor_id = actor.actor_id\
                  where concat(first_name, last_name)\
                  in (concat('Olympia', 'Pfeiffer'), concat('Julia', 'Zellweger'), concat('Ellen', 'Presley'))", con=connection_sqlalchemy)
df

                title first_name  last_name
0     Bilko Anonymous      Ellen    Presley
1   Caribbean Liberty      Ellen    Presley
2    Casper Dragonfly      Ellen    Presley
3    Empire Malkovich      Ellen    Presley
4       Floats Garden      Ellen    Presley
..                ...        ...        ...
64       Outlaw Hanky      Julia  Zellweger
65    Panky Submarine      Julia  Zellweger
66   Rider Caddyshack      Julia  Zellweger
67          Won Dares      Julia  Zellweger
68      Wyoming Storm      Julia  Zellweger

[69 rows x 3 columns]